Repository: 247i/TACETr
Catalog: பைத்தான்படிவங்கள்/weblate-memory.tmx
Source language: en
Languages: ta

source: Returns whether the accelerometer is available on the device.
ta: சாதனத்தில் முடுக்கமானி உள்ளதா என்பதை வழங்குகிறது.

source: If true, the sensor will generate events. Otherwise, no events are generated even if the device is accelerated or shaken.
ta: உண்மை எனில், சென்சார் நிகழ்வுகளை உருவாக்கும். இல்லையெனில், சாதனம் துரிதப்படுத்தப்பட்டாலும் அல்லது அசைக்கப்பட்டாலும் நிகழ்வுகள் எதுவும் உருவாக்கப்படாது.

source: Prior to the release that added this property the AccelerometerSensor component passed through sensor values directly as received from the Android system. However these values do not compensate for tablets that default to Landscape mode, requiring the MIT App Inventor programmer to compensate. However compensating would result in incorrect results in Portrait mode devices such as phones. We now detect Landscape mode tablets and perform the compensation. However if your project is already compensating for the change, you will now get incorrect results. Although our preferred solution is for you to update your project, you can also just set this property to “true” and our compensation code will be deactivated. Note: We recommend that you update your project as we may remove this property in a future release.
ta: இந்த பண்பைச் சேர்த்த வெளியீட்டிற்கு முன், ஆக்சிலரோமீட்டர் சென்சார் கூறு, ஆண்ட்ராய்டு சிஸ்டத்திலிருந்து பெறப்பட்ட சென்சார் மதிப்புகளை நேரடியாக அனுப்பியது. இருப்பினும், இந்த மதிப்புகள் லேண்ட்ஸ்கேப் பயன்முறையில் இயல்பாக இருக்கும் டேப்லெட்டுகளுக்கு ஈடுசெய்யாது, MIT ஆப் இன்வென்டர் புரோகிராமர் ஈடுசெய்ய வேண்டும். எவ்வாறாயினும், ஃபோன்கள் போன்ற போர்ட்ரெய்ட் பயன்முறை சாதனங்களில் இழப்பீடு தவறான முடிவுகளை ஏற்படுத்தும். நாங்கள் இப்போது லேண்ட்ஸ்கேப் பயன்முறை டேப்லெட்களைக் கண்டறிந்து இழப்பீடு செய்கிறோம். இருப்பினும், உங்கள் திட்டம் ஏற்கனவே மாற்றத்தை ஈடுசெய்கிறது என்றால், நீங்கள் இப்போது தவறான முடிவுகளைப் பெறுவீர்கள். உங்கள் திட்டத்தைப் புதுப்பிப்பதே எங்கள் விருப்பமான தீர்வாக இருந்தாலும், இந்தச் சொத்தை "உண்மை" என அமைக்கலாம், மேலும் எங்களின் இழப்பீட்டுக் குறியீடு செயலிழக்கப்படும். குறிப்பு: எதிர்கால வெளியீட்டில் இந்தச் சொத்தை நாங்கள் அகற்றக்கூடும் என்பதால், உங்கள் திட்டத்தைப் புதுப்பிக்குமாறு பரிந்துரைக்கிறோம்.

source: The minimum interval, in milliseconds, between phone shakes
ta: குறைந்தபட்ச இடைவெளி, மில்லி விநாடிகளில், ஃபோன் குலுக்கல்களுக்கு இடையே

source: Property for ActionBar
ta: அதிரடிபட்டிக்கான சொத்து

source: Action
ta: செயல்

source: Returns the action that will be used to start the activity.
ta: செயல்பாட்டைத் தொடங்கப் பயன்படுத்தப்படும் செயலை வழங்கும்.

source: AbsoluteStrength
ta: முழுமையானவலிமை

source: Indicates the absolute strength of the field.
ta: புலத்தின் முழுமையான வலிமையைக் குறிக்கிறது.

source: Non-visible component that can detect shaking and measure acceleration approximately in three dimensions using SI units (m/s<sup>2</sup>). The components are: <ul><li> <strong>xAccel</strong>: 0 when the phone is at rest on a flat surface, positive when the phone is tilted to the right (i.e., its left side is raised), and negative when the phone is tilted to the left (i.e., its right size is raised).</li> <li> <strong>yAccel</strong>: 0 when the phone is at rest on a flat surface, positive when its bottom is raised, and negative when its top is raised. </li> <li> <strong>zAccel</strong>: Equal to -9.8 (earth''s gravity in meters per second per second when the device is at rest parallel to the ground with the display facing up, 0 when perpendicular to the ground, and +9.8 when facing down. The value can also be affected by accelerating it with or against gravity. </li></ul>
ta: SI அலகுகளைப் பயன்படுத்தி (m/s<sup>2</sup>) தோராயமாக முப்பரிமாணத்தில் நடுக்கத்தைக் கண்டறிந்து முடுக்கத்தை அளவிடக்கூடிய கண்ணுக்குத் தெரியாத கூறு. கூறுகள்: <ul><li> <strong>xAccel</strong>: 0 ஃபோன் ஒரு தட்டையான மேற்பரப்பில் ஓய்வில் இருக்கும்போது, ஃபோனை வலது பக்கம் சாய்க்கும் போது நேர்மறை (அதாவது, அதன் இடது பக்கம் உயர்த்தப்பட்டிருக்கும்), மற்றும் ஃபோனை இடது பக்கம் சாய்க்கும் போது எதிர்மறையாக இருக்கும் (அதாவது, அதன் வலது அளவு உயர்த்தப்படும்).</li> <li> <strong>yAccel</strong>: 0 ஃபோன் ஒரு தட்டையான மேற்பரப்பில் ஓய்வில் இருக்கும்போது, நேர்மறை அதன் அடிப்பகுதி உயர்த்தப்படுகிறது, மற்றும் அதன் மேல் உயர்த்தப்படும் போது எதிர்மறை. </li> <li> <strong>zAccel</strong>: -9.8க்கு சமம் (பூமியின் ஈர்ப்பு வினாடிக்கு ஒரு வினாடிக்கு மீட்டரில், சாதனம் தரையில் இணையாக டிஸ்ப்ளே மேல்நோக்கி இருக்கும் போது, 0 தரையில் செங்குத்தாக, மற்றும் கீழே எதிர்கொள்ளும் போது +9.8. புவியீர்ப்பு விசையுடன் அல்லது எதிராக முடுக்கிவிடுவதன் மூலமும் மதிப்பைப் பாதிக்கலாம். </li></ul>

source: AboveRange
ta: வரம்பிற்கு மேல்

source: Go to Tutorial
ta: பயிற்சிக்குச் செல்லவும்

source: Text to Speech is surprisingly fun. Find out for yourself with this starter app that talks.
ta: உரைக்கு பேச்சு ஆச்சரியமாக வேடிக்கையாக உள்ளது. பேசும் இந்த தொடக்க பயன்பாட்டின் மூலம் நீங்களே கண்டுபிடிக்கவும்.

source: Talk to Me
ta: என்னிடம் பேசு

source: Quickly translate English to Spanish (and other languages too!) You''re challenged with creating an app that could act as an aid for immigrant parents who need a little extra help in English-speaking situations. Inspired by YR Media story {0}What It''s Like to be a Translator{1}.
ta: ஆங்கிலத்தை ச்பானிச் மொழியில் விரைவாக மொழிபெயர்க்கவும் (மற்றும் பிற மொழிகளிலும்!) ஆங்கிலம் பேசும் சூழ்நிலைகளில் சிறிது கூடுதல் உதவி தேவைப்படும் புலம்பெயர்ந்த பெற்றோருக்கு உதவியாக செயல்படும் ஒரு பயன்பாட்டை உருவாக்குவது உங்களுக்கு சவாலாக உள்ளது. YR மீடியா கதையால் ஈர்க்கப்பட்டு {0} மொழிபெயர்ப்பாளராக இருப்பது எப்படி இருக்கிறது {1}.

source: Translate App
ta: பயன்பாட்டை மொழிபெயர்க்கவும்

source: Welcome to
ta: வரவேற்கிறோம்

source: AI Companion
ta: செயற்கை நுண்ணறிவு தோழன்

source: AboutScreen
ta: திரை பற்றி

source: Information about the screen. It appears when "About this Application" is selected from the system menu. Use it to inform people about your app. In multiple screen apps, each screen has its own AboutScreen info.
ta: திரை பற்றிய தகவல். சிஸ்டம் மெனுவிலிருந்து "இந்த பயன்பாட்டைப் பற்றி" தேர்ந்தெடுக்கும்போது அது தோன்றும். உங்கள் பயன்பாட்டைப் பற்றி மக்களுக்குத் தெரிவிக்க இதைப் பயன்படுத்தவும். பல திரை பயன்பாடுகளில், ஒவ்வொரு திரையிலும் அதன் சொந்த "திரை பற்றி" தகவல் உள்ளது.

source: Distance has gone above the range.
ta: தூரம் வரம்புக்கு மேல் சென்றுவிட்டது.

source: AboveRangeEventEnabled
ta: மேல் வரம்பு நிகழ்வு இயக்கப்பட்டது

source: Close
ta: மூடு

source: Get started with some tutorials
ta: சில பயிற்சிகளுடன் தொடங்கவும்

source: Hello Purr
ta: வணக்கம் பூர்

source: HelloPurr is a simple app that you can build in a very short time. You create a button that has a picture of a cat on it, and then program the button so that when it is clicked a "meow" sound plays.
ta: வணக்கம்பூனை என்பது மிக குறுகிய காலத்தில் நீங்கள் உருவாக்கக்கூடிய ஒரு எளிய செயலி. நீங்கள் ஒரு பூனையின் படத்தைக் கொண்ட ஒரு பொத்தானை உருவாக்கி, பின்னர் பொத்தானை நிரல் செய்யுங்கள், அதனால் அது "மியாவ்" ஒலி கேட்கும்.

source: Start a blank project
ta: ஒரு வெற்றுத் திட்டத்தைத் தொடங்குங்கள்

source: Whether the AboveRange event should fire when the distance goes above the TopOfRange.
ta: தூரம் "வரம்பிற்கு மேலே செல்லும்போது "வரம்பிற்கு மேல்" நிகழ்வு உருவாக்கப்பட வேண்டுமா.

source: Indicates the acceleration changed in the X, Y, and/or Z dimensions.
ta: X, Y, மற்றும்/அல்லது Z பரிமாணங்களில் மாற்றப்பட்ட முடுக்கத்தைக் குறிக்கிறது.

source: AccelerationChanged
ta: முடுக்கம் மாற்றப்பட்டது

source: AccentColor
ta: உச்சரிப்பு நிறம்

source: This is the accent color used for highlights and other user interface accents.
ta: சிறப்பம்சங்கள் மற்றும் பிற பயனர் இடைமுக உச்சரிப்புகளுக்கு பயன்படுத்தப்படும் உச்சரிப்பு நிறம் இது.

source: Accept an incoming connection with the Serial Port Profile (SPP).
ta: தொடர் துறைமுகம் சுயவிவரத்துடன் (தொ.து.சு) உள்வரும் இணைப்பை ஏற்கவும்.

source: AcceptConnection
ta: இணைப்பை ஏற்கவும்

source: Accept an incoming connection with a specific UUID.
ta: ஒரு குறிப்பிட்ட UUID உடன் உள்வரும் இணைப்பை ஏற்கவும்.

source: AcceptConnectionWithUUID
ta: UUID உடன் இணைப்பை ஏற்கவும்.

source: Accuracy
ta: துல்லியம்

source: The most recent measure of accuracy, in meters. If no value is available, 0 will be returned.
ta: துல்லியத்தின் மிக சமீபத்திய அளவீடு, மீட்டரில். மதிப்பு இல்லை என்றால், 0 திருப்பித் தரப்படும்.

source: ActionBar
ta: செயல் பட்டி

source: Delete all %1 blocks?
ta: அனைத்து % 1 தொகுதிகளையும் நீக்கவா?

source: Returns an instant in time some days after the given instant.
ta: கொடுக்கப்பட்ட உடனடி நேரத்திற்குப் பிறகு சில நாட்களுக்குப் பிறகு ஒரு நொடியை வழங்கும்.

source: ActivityPackage
ta: செயல்பாட்டுதொகுப்பு

source: Returns the package part of the specific component that will be started.
ta: தொடங்கப்படும் குறிப்பிட்ட கூறுகளின் தொகுப்பு பகுதியை வழங்குகிறது.

source: A component that can launch an activity using the <code>StartActivity</code> method. <p>Activities that can be launched include:<ul> <li> Starting another App Inventor for Android app. To do so, first find out the <em>class</em> of the other application by downloading the source code and using a file explorer or unzip utility to find a file named "youngandroidproject/project.properties". The first line of the file will start with "main=" and be followed by the class name; for example, <code>main=com.gmail.Bitdiddle.Ben.HelloPurr.Screen1</code>. (The first components indicate that it was created by Ben.Bitdiddle
ta: <code>StartActivity</code> முறையைப் பயன்படுத்தி செயல்பாட்டைத் தொடங்கக்கூடிய ஒரு கூறு. <p>தொடங்கக்கூடிய செயல்பாடுகளில் பின்வருவன அடங்கும்:<ul> <li> Android பயன்பாட்டிற்கான மற்றொரு ஆப் கண்டுபிடிப்பாளரைத் தொடங்குதல். அவ்வாறு செய்ய, மூலக் குறியீட்டைப் பதிவிறக்கி, "youngandroidproject/project.properties" என்ற பெயரைக் கண்டறிய, கோப்பு எக்ஸ்ப்ளோரர் அல்லது அன்ஜிப் பயன்பாட்டைப் பயன்படுத்தி, பிற பயன்பாட்டின் <em>வகுப்பு</em> என்பதை முதலில் கண்டறியவும். கோப்பின் முதல் வரி "main=" எனத் தொடங்கும் மற்றும் அதைத் தொடர்ந்து வகுப்புப் பெயரும் இருக்கும்; எடுத்துக்காட்டாக, <code>main=com.gmail.Bitdiddle.Ben.HelloPurr.Screen1</code>. (முதல் கூறுகள் இது Ben.Bitdiddle ஆல் உருவாக்கப்பட்டது என்பதைக் குறிக்கிறது

source: Returns the result from the activity.
ta: செயல்பாட்டின் முடிவை வழங்குகிறது.

source: Undo
ta: செயல்தவிர்

source: Clean up Blocks
ta: தொகுதிகளை சுத்தம் செய்யவும்

source: Hide Workspace Controls
ta: பணியிடக் கட்டுப்பாடுகளை மறை

source: External Inputs
ta: வெளிப்புற உள்ளீடுகள்

source: Inline Inputs
ta: கோட்டில் உள்ளீடுகள்

source: Arrange Parameters Horizontally
ta: அளவுருக்களை கிடைமட்டமாக அமைக்கவும்

source: Arrange Parameters Vertically
ta: அளவுருக்களை செங்குத்தாக அமைக்கவும்

source: Confirm deletion
ta: நீக்குவதை உறுதிப்படுத்தவும்

source: Event raised if this ActivityStarter returns because the activity was canceled.
ta: செயல்பாடு ரத்துசெய்யப்பட்டதால், இந்தச் செயல்பாட்டுத்தொடக்கி திரும்பினால் நிகழ்வு உயர்த்தப்படும்.

source: ActivityCanceled
ta: செயல்பாடு ரத்துசெய்யப்பட்டது.

source: ActivityClass
ta: செயல்பாட்டுவகுப்பு

source: Returns the class part of the specific component that will be started.
ta: தொடங்கப்படும் குறிப்பிட்ட கூறுகளின் வகுப்புப் பகுதியை வழங்குகிறது.

source: The ActivityError event is no longer used. Please use the Screen.ErrorOccurred event instead.
ta: செயல்பாட்டுப் பிழை நிகழ்வு இனி பயன்படுத்தப்படாது. அதற்குப் பதிலாக 'திரைப்.பிழைஏற்பட்டது' நிகழ்வைப் பயன்படுத்தவும்.

source: AddDays
ta: நாட்களைச்சேர்க்கவும்
